from django import forms
from django.forms import ModelForm
from .models import Rent


class RentForm(forms.Form):
    begin_date = forms.DateField(input_formats=['%d/%m/%Y', '%m/%d/%Y',])
    end_date = forms.DateField(input_formats=['%d/%m/%Y', '%m/%d/%Y',])


class SearchForm(forms.Form):
    CITIES = (
        ('تهران', 'تهران'),
        ( 'اراک', 'اراک'),
        ('سنندج', 'سنندج'),
        ('یاسوج', 'یاسوج'),
        ('بوشهر', 'بوشهر'),
        ('جم', 'جم'),
        ('اصفهان', 'اصفهان'),
        ('تبریز', 'تبریز'),
        ('قزوین', 'قزوین'),
        ('مشهد', 'مشهد'),
        ('سازی','سازی'),
        ('بیرجند', 'بیرجند'),
        ('زاهدان', 'زاهدان'),
        ('کرمان', 'کرمان'),
        ('زابل', 'زابل'),
        ('اهواز', 'اهواز'),
        ('آبادان', 'آبادان'),
        ('قم', 'قم'),
        ('کرمانشاه', 'کرمانشاه'),
        ('ایلام', 'ایلام'),
        ('ساوه', 'ساوه'),
        ('قائن', 'قائن'),
        ('قوچان', 'قوچان'),
        ('یزد', 'یزد'),
        ('شیراز', 'شیراز'),
        ('رشت', 'رشت'),
        ('شهرکرد', 'شهرکرد'),
        ('طبس', 'طبس'),
        ('نیشابور', 'نیشابور'),
        ('ری', 'ری'),
        ('کرج', 'کرج'),
        ('سمنان', 'سمنان'),
        ('شاهرود', 'شاهرود'),
        ('سبزوار', 'سبزوار'),
    )
    city = forms.ChoiceField(choices=CITIES)
